;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

(package! highlight-indent-guides)
(package! groovy-mode)
(package! evil-surround)
(package! company-posframe :recipe (:fetcher github :repo "tumashu/company-posframe"))
;; (package! lsp-mode)
(package! lsp-mode :recipe (:fetcher github :repo "emacs-lsp/lsp-mode"))
(package! lsp-ui :recipe (:fetcher github :repo "emacs-lsp/lsp-ui"))
(package! lsp-javascript-typescript :recipe (:fetcher github :repo "emacs-lsp/lsp-javascript"))
(package! lsp-typescript :recipe (:fetcher github :repo "emacs-lsp/lsp-javascript"))
(package! tmux-pane)
